<a href="https://colab.research.google.com/github/LinhTo11/Salary_2020/blob/main/Salary_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [5]:
df=pd.read_csv('/content/drive/MyDrive/PET/survey_results_public 2020.csv')
print(df.head())

   Respondent  ... YearsCodePro
0           1  ...           27
1           2  ...            4
2           3  ...          NaN
3           4  ...            4
4           5  ...            8

[5 rows x 61 columns]

In [8]:
df = df[['Country', 'EdLevel', 'YearsCodePro', 'Employment', 'ConvertedComp']]
df = df.rename({'ConvertedComp': 'Salary'}, axis = 1)
df.head()

              Country  ... Salary
0             Germany  ...    NaN
1      United Kingdom  ...    NaN
2  Russian Federation  ...    NaN
3             Albania  ...    NaN
4       United States  ...    NaN

[5 rows x 5 columns]

In [ ]:
#Clean datat

In [ ]:
df = df[df['Salary'].notnull()]
df.head()

In [11]:
df = df[df['Salary'].notnull()]
df.head()

           Country  ...    Salary
7    United States  ...  116000.0
9   United Kingdom  ...   32315.0
10  United Kingdom  ...   40070.0
11           Spain  ...   14268.0
12     Netherlands  ...   38916.0

[5 rows x 5 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 34756 entries, 7 to 64154
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country       34756 non-null  object
 1   EdLevel       34188 non-null  object
 2   YearsCodePro  34621 non-null  object
 3   Employment    34717 non-null  object
 4   Salary        34756 non-null  float64
dtypes: float64(1), object(4)
memory usage: 2.8+ MB

In [12]:
df = df.dropna()
df.isnull().sum()

Country         0
EdLevel         0
YearsCodePro    0
Employment      0
Salary          0
dtype: int64

In [ ]:
#Next time edit and drop create a new df

df = df[df['Employment'] == 'Employed full-time']
df = df.drop('Employment', axis = 1)
df.info()

In [17]:
df.head()

           Country  ...    Salary
7    United States  ...  116000.0
9   United Kingdom  ...   32315.0
10  United Kingdom  ...   40070.0
11           Spain  ...   14268.0
12     Netherlands  ...   38916.0

[5 rows x 4 columns]

In [23]:
df['Country'].value_counts()

United States     7569
India             2425
United Kingdom    2287
Germany           1903
Canada            1178
                  ...
Senegal              1
San Marino           1
Barbados             1
Swaziland            1
Belize               1
Name: Country, Length: 154, dtype: int64

In [26]:
type(df['Country'].value_counts().index)

pandas.core.indexes.base.Index

In [ ]:
#get rid of countries where there are too few values 
#because it's gonna confuse the ML

#a pandas series will take 2 argument: index and values
#You can try printing them out

def shorten_categories (categories, cutoff):
  categorical_map = {}
  for i in range(len(categories)):
    if categories.values[i] >= cutoff:
      categorical_map[categories.index[i]] = categories.index[i]
    else:
      categorical_map[categories.index[i]] = 'Other'
  return categorical_map

In [ ]:
country_map = shorten_categories(df.Country.values_counts(), 400)
df['Country'] = df[Country].map(country_map)
df.Country.value_counts